README.md
- [citronella](#sec-1)
  - [Usage](#sec-1-1)
  - [License](#sec-1-2)

# citronella<a id="sec-1"></a>

FIXME: my new library.

## Usage<a id="sec-1-1"></a>

FIXME: write usage documentation!

Run the project's tests (they'll fail until you edit them):

    $ clojure -A:test:runner -M:runner

Build a deployable jar of this library:

    $ clojure -A:jar -M:jar

Install it locally:

    $ clojure -A:install -M:install

Deploy it to Clojars &#x2013; needs \`CLOJARS<sub>USERNAME</sub>\` and \`CLOJARS<sub>PASSWORD</sub>\` environment variables:

    $ clojure -A:deploy -M:deploy

## License<a id="sec-1-2"></a>

Copyright © 2020 Tim Cross

Distributed under the GNU Public License version 3
